```json
{
  "scene_id": "InitialEncounter_OfficeFloor",
  "location": "Main Office Floor - Elias Thorne's Desk",
  "summary": "The player stands before the gruesome scene of Elias Thorne's murder, an ornate letter opener embedded in his back. The player's question, 'Who are you?', startles a figure already present, casting immediate suspicion and initiating the first critical interaction at the crime scene. The air is thick with the scent of ozone and the weight of sudden death.",
  "present_characters": [
    "Player",
    "Detective Harding"
  ],
  "beats": [
    {
      "beat_id": "player_questions_stranger",
      "description": "The player's question, 'Who are you?', cuts through the unsettling silence of the office, directed at the figure standing near the victim."
    },
    {
      "beat_id": "harding_startled_reaction",
      "description": "Detective Harding, who was previously surveying the scene or focused on something near the body, visibly stiffens and spins around, their expression a mix of surprise and guarded scrutiny."
    },
    {
      "beat_id": "harding_introduces_self",
      "description": "Harding quickly regains composure, their posture becoming more official. 'Detective Harding,' they state, their voice firm but not aggressive. 'And you are...?'"
    },
    {
      "beat_id": "harding_acknowledges_victim",
      "description": "Harding's gaze flicks to the victim, a grim acknowledgment in their eyes, before returning to the player, subtly implying the seriousness of the situation."
    },
    {
      "beat_id": "player_is_on_the_spot",
      "description": "The player is now prompted to identify themselves and explain their presence, under the watchful eye of a presumed authority figure."
    }
  ],
  "visible_clues": [
    {
      "clue_id": "victim_body_position",
      "description": "Elias Thorne, slumped over his keyboard, head resting awkwardly on his arms, a macabre tableau."
    },
    {
      "clue_id": "murder_weapon",
      "description": "An elegant, silver-handled letter opener, possibly decorative rather than utilitarian, protruding from Elias's back."
    },
    {
      "clue_id": "desk_clutter",
      "description": "An overturned coffee mug with a dark, still-wet stain spreading across the desk, next to a half-eaten granola bar and several technical manuals."
    },
    {
      "clue_id": "computer_screens",
      "description": "Three large monitors flicker with lines of code and complex data visualizations, one displaying an error message."
    },
    {
      "clue_id": "ozone_scent",
      "description": "A faint but distinct scent of ozone hangs in the air, mingling with the stale smell of late-night coffee."
    },
    {
      "clue_id": "harding_badge",
      "description": "A discreet but official-looking badge or ID clip visible on Detective Harding's belt or jacket lapel."
    }
  ],
  "hidden_tension": "Both the player and Detective Harding are instantly sizing each other up, each questioning the other's true motive for being at the crime scene. An unspoken professional rivalry or suspicion of involvement simmers beneath Harding's composed exterior.",
  "music_mood": "Eerie Silence with Undercurrents of Tension",
  "visual_hooks": [
    "The sharp, clinical glare of fluorescent lights reflecting off the polished office floor, creating long, distorted shadows.",
    "The stark contrast between the lifeless, crumpled form of Elias Thorne and the vibrant, flickering data on his computer screens.",
    "The glint of the silver letter opener, catching the light as the central, gruesome focal point.",
    "Detective Harding's composed, yet watchful, expression framed against the sterile, empty cubicles of the late-night office.",
    "The spreading dark stain of coffee on the desk, a small detail in the larger chaos."
  ],
  "victim_name": "Elias Thorne"
}
```